def search(val):
    my_dict = {
        'Беларусь': {'Минск', 'Гомель', 'Гродно', 'Могилёв', 'Витебск', 'Брест'},
        'Болгария': ('София', 'Пловдив', 'Варна', 'Бургас', 'Русе', 'Плевен'),
        'Грузия': ('Тбилиси', 'Батуми', 'Кутаиси', 'Рустави', 'Гори', 'Загудиди'),
        'Германия': ('Берлин', 'Гамбург', 'Мюнхен', 'Кельн', 'Штутгарт', 'Эссен'),
        'Турция': ('Стамбул', 'Анкара', 'Изимир', 'Бурса', 'Адана', 'Конья'),
        'Ямайка': ('Кингстон', 'Спаниш-Таун', 'Портмор', 'Монтего-Бей', 'Негрил', 'Мандевиль'),
    }
    for key, value in my_dict.items():
        for i in value:
            if i == val:
                return key

val = input('Введите название города: ')
print('Это город страны: ', search(val))